[
  {
    "_id": "1",
    "title": "Why Life Insurance is Essential in 2025",
    "image": "https://i.ibb.co/FLYGydN8/1.jpg",
    "details": "Life insurance provides financial security to your family. Learn why now is the best time to get covered.",
    "fullDetails": "Life insurance protects your loved ones by ensuring they have financial support after your passing. It's a smart investment for long-term peace of mind.",
    "author": "Masud Parvaz",
    "date": "2025-07-01T08:00:00Z",
    "visits": 34
  },
  {
    "_id": "2",
    "title": "Term vs Whole Life Insurance: What to Choose?",
    "image": "https://i.ibb.co/7NynDBhL/2-1.jpg",
    "details": "Understand the difference between term and whole life insurance so you can make the best choice for your family.",
    "fullDetails": "Term insurance offers coverage for a limited time at a lower cost, while whole life insurance provides lifelong protection and a cash value component.",
    "author": "Sarah Ahmed",
    "date": "2025-07-03T10:00:00Z",
    "visits": 19
  },
  {
    "_id": "3",
    "title": "Top 5 Reasons to Get Life Insurance Before 30",
    "image": "https://i.ibb.co/Nd6R58y1/3-1.jpg",
    "details": "Buying insurance early locks in lower premiums and secures your financial future.",
    "fullDetails": "Younger individuals benefit from lower premiums, fewer health concerns, and longer-term security. Discover why early coverage is a game-changer.",
    "author": "Reza Khan",
    "date": "2025-07-05T09:30:00Z",
    "visits": 27
  },
  {
    "_id": "4",
    "title": "How to Choose the Right Life Insurance Plan",
    "image": "https://i.ibb.co/5hRpPtCd/4-1.jpg",
    "details": "Struggling to pick the right plan? Here's a step-by-step guide to help you decide.",
    "fullDetails": "Assess your budget, family needs, and financial goals to choose between term, whole, or universal insurance plans effectively.",
    "author": "Fatima Noor",
    "date": "2025-07-07T11:15:00Z",
    "visits": 12
  },
  {
    "_id": "5",
    "title": "Does Life Insurance Cover Critical Illness?",
    "image": "https://i.ibb.co/83Ww5VY/5-1-1.jpg",
    "details": "Learn whether your policy protects you in case of cancer, stroke, or heart attack.",
    "fullDetails": "Many modern policies include critical illness riders. Understand the terms and what diseases are covered before you commit.",
    "author": "Dr. Asif Rahman",
    "date": "2025-07-08T14:00:00Z",
    "visits": 9
  },
  {
    "_id": "6",
    "title": "Top Life Insurance Myths Debunked",
    "image": "https://i.ibb.co/Jj1rQD3W/6-1-1.jpg",
    "details": "Think life insurance is too expensive or only for old people? Think again.",
    "fullDetails": "From affordability to eligibility, we bust the biggest myths preventing people from getting covered in time.",
    "author": "Tania Islam",
    "date": "2025-07-09T16:30:00Z",
    "visits": 18
  },
  {
    "_id": "7",
    "title": "How Smoking Affects Your Life Insurance Premium",
    "image": "https://i.ibb.co/vxfCq3Pv/7-1.jpg",
    "details": "Smokers often pay more for insurance. Here’s how much and why.",
    "fullDetails": "Life insurers view smokers as higher risk. You could pay up to 50% more in premiums. Quitting can reduce your cost over time.",
    "author": "Nashid Anwar",
    "date": "2025-07-10T09:20:00Z",
    "visits": 21
  },
  {
    "_id": "8",
    "title": "Life Insurance for Stay-at-Home Parents",
    "image": "https://i.ibb.co/KpFQ1Jg4/9-1.jpg",
    "details": "Even if you’re not earning, your work at home has huge value. Protect it.",
    "fullDetails": "Stay-at-home parents provide childcare, housework, and emotional support. Their loss can cost families dearly. Life insurance can provide a safety net.",
    "author": "Lubna Rahim",
    "date": "2025-07-11T10:00:00Z",
    "visits": 15
  },
  {
    "_id": "9",
    "title": "Understanding Riders in Life Insurance Policies",
    "image": "https://i.ibb.co/fzSkdGJ1/10-1.jpg",
    "details": "Riders enhance your base policy. Find out which ones are worth it.",
    "fullDetails": "Common riders include accidental death, critical illness, premium waiver, and income benefits. Know which fits your needs best.",
    "author": "Sajib Hossain",
    "date": "2025-07-12T08:45:00Z",
    "visits": 11
  },
  {
    "_id": "10",
    "title": "How to File a Life Insurance Claim",
    "image": "https://i.ibb.co/F4P5nKYM/11-1.jpg",
    "details": "Filing a claim should be simple. Here’s a clear process to follow.",
    "fullDetails": "Notify the insurer, submit the required documents, and follow up. Learn the dos and don'ts to avoid rejection.",
    "author": "Amena Sultana",
    "date": "2025-07-13T13:10:00Z",
    "visits": 8
  },
  {
    "_id": "11",
    "title": "How Much Life Insurance Do You Need?",
    "image": "https://i.ibb.co/S7f24V08/12-1.jpg",
    "details": "Avoid overpaying or underinsuring. Use this formula to find your ideal coverage.",
    "fullDetails": "A common method: 10x your annual income + debts + children's education. Tailor it based on your needs.",
    "author": "Farhan Kabir",
    "date": "2025-07-14T10:00:00Z",
    "visits": 23
  },
  {
    "_id": "12",
    "title": "Can You Change Life Insurance Beneficiaries?",
    "image": "https://i.ibb.co/939b6wk6/13-1.jpg",
    "details": "Yes, but with conditions. Here’s how and when to update your beneficiaries.",
    "fullDetails": "Most policies allow you to update beneficiaries at any time. Legal and spousal restrictions may apply.",
    "author": "Tariq Hasan",
    "date": "2025-07-15T11:45:00Z",
    "visits": 6
  },
  {
    "_id": "13",
    "title": "What Happens If You Miss a Premium Payment?",
    "image": "https://i.ibb.co/9HjQMrYz/14-1.jpg",
    "details": "Missed a payment? Don’t panic. You may still be covered.",
    "fullDetails": "Most policies offer a grace period (15–30 days). After that, your policy may lapse. You can often reinstate with a late fee.",
    "author": "Sumaiya Akter",
    "date": "2025-07-16T09:30:00Z",
    "visits": 5
  },
  {
    "_id": "14",
    "title": "Is Life Insurance Taxable in Bangladesh?",
    "image": "https://i.ibb.co/TDtMq75/15-1.jpg",
    "details": "Know the tax rules so you or your heirs don’t lose out.",
    "fullDetails": "In most cases, payouts are tax-free. But certain investment-linked policies may have exceptions. Consult a tax advisor.",
    "author": "Mohammad Faisal",
    "date": "2025-07-17T15:00:00Z",
    "visits": 7
  },
  {
    "_id": "15",
    "title": "Top Life Insurance Providers in Bangladesh (2025)",
    "image": "https://i.ibb.co/JwdbbZYQ/16-1.jpg",
    "details": "Explore the top-rated insurers based on service, claim ratio, and premium value.",
    "fullDetails": "LIC Bangladesh, MetLife, Jiban Bima Corporation, and Pragati Life lead the market. Learn their pros and cons.",
    "author": "Nusrat Jahan",
    "date": "2025-07-18T12:15:00Z",
    "visits": 29
  },
  {
    "_id": "16",
    "title": "Can You Have Multiple Life Insurance Policies?",
    "image": "https://i.ibb.co/xS0VWdQ3/17-1.jpg",
    "details": "Yes, but be aware of the pros, cons, and legal implications.",
    "fullDetails": "Multiple policies can boost coverage, but claims must be transparent. Don’t exceed your insurability limit.",
    "author": "Shuvo Rahman",
    "date": "2025-07-19T10:30:00Z",
    "visits": 17
  },
  {
    "_id": "17",
    "title": "Life Insurance for Self-Employed People",
    "image": "https://i.ibb.co/xS0VWdQ3/17-1.jpg",
    "details": "Freelancers and business owners need protection too. Here’s how to plan it.",
    "fullDetails": "Without employer benefits, self-employed people must secure their own coverage. Choose flexible, income-based policies.",
    "author": "Sadia Mehzabin",
    "date": "2025-07-20T14:10:00Z",
    "visits": 14
  },
  {
    "_id": "18",
    "title": "Universal Life Insurance: A Smart Long-Term Choice?",
    "image": "https://i.ibb.co/xS0VWdQ3/17-1.jpg",
    "details": "Universal life combines protection with investment. But is it right for you?",
    "fullDetails": "Universal life policies allow premium flexibility and cash value growth. Ideal for long-term wealth planning.",
    "author": "Iftekhar Ahmed",
    "date": "2025-07-21T16:00:00Z",
    "visits": 13
  },
  {
    "_id": "19",
    "title": "Why Life Insurance Premiums Rise with Age",
    "image": "https://i.ibb.co/xS0VWdQ3/17-1.jpg",
    "details": "The older you are, the more you’ll pay. Here’s why age matters.",
    "fullDetails": "With age, health risks increase, raising your insurance premium. Buying young saves money in the long run.",
    "author": "Samin Mahmud",
    "date": "2025-07-22T10:45:00Z",
    "visits": 10
  },
  {
    "_id": "20",
    "title": "Tips for Saving on Life Insurance",
    "image": "https://i.ibb.co/xS0VWdQ3/17-1.jpg",
    "details": "Looking to save money while staying protected? Try these tips.",
    "fullDetails": "Compare policies, avoid unnecessary riders, maintain a healthy lifestyle, and buy early. These steps can significantly cut your premium.",
    "author": "Rafiul Islam",
    "date": "2025-07-23T12:20:00Z",
    "visits": 20
  }
]
